fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/Forms/ВКМ_ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//ВКМ - Программное создание элементов формы и отображение
	ВКМ_СоздатьЭлементыФормыНаСервере();
	ВКМ_ОтображениеЭлементовФормыНаСервере();
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	//ВКМ - Отображение элементов формы
	ВКМ_ОтображениеЭлементовФормыНаСервере();
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВКМ_СоздатьЭлементыФормыНаСервере()
	
	//ВКМ - Создание элементов флормы для договоров абонентского обслуживания
	
	Если Элементы.Найти("ВКМ_ГруппаПериодДоговора") <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВКМ_ГруппаПериодДоговора = Элементы.Вставить("ВКМ_ГруппаПериодДоговора", Тип("ГруппаФормы"), ЭтотОбъект);
	ВКМ_ГруппаПериодДоговора.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ВКМ_ГруппаПериодДоговора.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
	ВКМ_ГруппаПериодДоговора.Заголовок = "Период действия договора";

	ВКМ_ДатаНачала = Элементы.Вставить("ВКМ_ДатаНачала", Тип("ПолеФормы"), ВКМ_ГруппаПериодДоговора);
	ВКМ_ДатаНачала.Вид = ВидПоляФормы.ПолеВвода;
	ВКМ_ДатаНачала.ПутьКДанным = "Объект.ВКМ_ДатаНачала";
		
	ВКМ_ДатаОкончания = Элементы.Вставить("ВКМ_ДатаОкончания", Тип("ПолеФормы"), ВКМ_ГруппаПериодДоговора);
	ВКМ_ДатаОкончания.Вид = ВидПоляФормы.ПолеВвода;
	ВКМ_ДатаОкончания.ПутьКДанным = "Объект.ВКМ_ДатаОкончания";
	
	ВКМ_СуммаАбонентскойПлаты = Элементы.Вставить("ВКМ_СуммаАбонентскойПлаты", Тип("ПолеФормы"), ЭтотОбъект);
	ВКМ_СуммаАбонентскойПлаты.Вид = ВидПоляФормы.ПолеВвода;
	ВКМ_СуммаАбонентскойПлаты.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";
	 
	ВКМ_СтоимостьЧасаРаботы = Элементы.Вставить("ВКМ_СтоимостьЧасаРаботы", Тип("ПолеФормы"), ЭтотОбъект);
	ВКМ_СтоимостьЧасаРаботы.Вид = ВидПоляФормы.ПолеВвода;
	ВКМ_СтоимостьЧасаРаботы.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";
	
КонецПроцедуры

&НаСервере
Процедура ВКМ_ОтображениеЭлементовФормыНаСервере()
	
	//ВКМ - Определение отображения элементов формы
	АбонентскийВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание");
	Абонент = (Объект.ВидДоговора = АбонентскийВидДоговора);
	Элементы.ВКМ_ГруппаПериодДоговора.Видимость = Абонент;
	Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = Абонент;
	Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Абонент;
	
КонецПроцедуры

#КонецОбласти
